#+TITLE: A generic Heap Datastructure in C#

** Simple Test

#+BEGIN_SRC csharp :tangle demo/test.cs 
using System; 

public class Test {

  public static void Main() {

    var H = new Heap<int>();
    H.Insert(7);
    H.Insert(4);
    H.Insert(6);
    H.Insert(3);
    H.Insert(2);
    H.Insert(5);
    H.Insert(1);

    while(H.Count > 0) 
      Console.WriteLine(H.Remove());
  }
}
#+END_SRC

#+BEGIN_SRC sh :results output :exports both
mcs demo/test.cs src/heap.cs
mono demo/test.exe
#+END_SRC

#+RESULTS:
: Compilation failed: 2 error(s), 0 warnings
: 1
: 2
: 3
: 4
: 5
: 6
: 7

** Reverse Order 

#+BEGIN_SRC csharp :tangle demo/testcompare.cs 
using System; 

public class TestCompare {

  public static void Main() {

    var H = new Heap<int>((x,y) => y - x);
    H.Insert(7);
    H.Insert(4);
    H.Insert(6);
    H.Insert(3);
    H.Insert(2);
    H.Insert(5);
    H.Insert(1);

    while(H.Count > 0) 
      Console.WriteLine(H.Remove());
  }
}
#+END_SRC

#+BEGIN_SRC sh :results output :exports both
mcs demo/testcompare.cs src/heap.cs
mono demo/testcompare.exe
#+END_SRC

#+RESULTS:
: 7
: 6
: 5
: 4
: 3
: 2
: 1

** Heap Sort Performance 

Sort a Million numbers

#+BEGIN_SRC csharp :tangle demo/heapsort.cs 
using System; 
using System.Collections.Generic; 
using System.Diagnostics; 

public class Heapsort {

  public static void Main() {

    int n = 1000000;
    var random = new Random();
    var L = new List<int>(n);
    Console.WriteLine("Generating {0} random elements...", n); 
    for(int i = 0; i < n; i++)
      L.Add(random.Next()); 

    var H = new Heap<int>();
    Console.WriteLine("Sorting {0} random elements...", n); 
    var sw = Stopwatch.StartNew(); 
    foreach(var i in L) 
      H.Insert(i); 
    var elapsedInsert = sw.ElapsedMilliseconds;
    while(H.Count > 0) 
      H.Remove();
    var elapsedRemove = sw.ElapsedMilliseconds;
    sw.Stop(); 
    Console.WriteLine("Insertion: {0} Removal: {1} Combined: {2}", elapsedInsert, elapsedRemove, elapsedInsert + elapsedRemove); 
  }
}
#+END_SRC

#+BEGIN_SRC sh :results verbatim :exports both
mcs demo/heapsort.cs src/heap.cs 
mono demo/heapsort.exe
#+END_SRC

#+RESULTS:
: Generating 1000000 random elements...
: Sorting 1000000 random elements...
: Insertion: 61 Removal: 773 Combined: 834

Note:  Insertion is very fast while Removal is kind of slow. 

Both operations run in O(log n) time, but Insertion is way more fast. Tests show that in practice Up Bubbling rarely exceeds a few levels, while Down Bubbling almost /always/ needs to process the whole tree height. 


